AlexShiLucky/nuttx-kernel/configs/lpc4357-dev/src/lpc4357-dev.h
/****************************************************************************
 * configs/lpc4357-dev/src/lpc4357-dev.h
 *
 *   Copyright (C) 2014 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <gnutt@nuttx.org>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

#ifndef _CONFIGS_LPC4357_DEV_SRC_LPC3257_DEV_H
#define _CONFIGS_LPC4357_DEV_SRC_LPC3257_DEV_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include <nuttx/compiler.h>

#include "lpc43_pinconfig.h"
#include "lpc43_gpio.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/
/* LED definitions **********************************************************/
/* The LPC4357-DEV has one user-controllable LED labelled D6 controlled by
 * the signal LED_3V3:
 *
 *  ---- ------- -------------
 *  LED  SIGNAL  MCU
 *  ---- ------- -------------
 *   D6  LED_3V3 PE_7 GPIO7[7]
 *  ---- ------- -------------
 *
 * A low output illuminates the LED.
 *
 * Definitions to configure LED pins as GPIOs:
 *
 * - Floating
 * - Normal drive
 * - No buffering, glitch filtering, slew=slow
 */

#define PINCONFIG_LED0  PINCONF_GPIO6p24
#define PINCONFIG_LED1  PINCONF_GPIO6p25
#define PINCONFIG_LED2  PINCONF_GPIO6p26
#define PINCONFIG_LED3  PINCONF_GPIO6p27
#define PINCONFIG_LED4  PINCONF_GPIO6p28

/* Definitions to configure LED GPIO as outputs */

#define GPIO_LED0       (GPIO_MODE_OUTPUT | GPIO_VALUE_ONE | GPIO_PORT6 | GPIO_PIN24)
#define GPIO_LED1       (GPIO_MODE_OUTPUT | GPIO_VALUE_ONE | GPIO_PORT6 | GPIO_PIN25)
#define GPIO_LED2       (GPIO_MODE_OUTPUT | GPIO_VALUE_ONE | GPIO_PORT6 | GPIO_PIN26)
#define GPIO_LED3       (GPIO_MODE_OUTPUT | GPIO_VALUE_ONE | GPIO_PORT6 | GPIO_PIN27)
#define GPIO_LED4       (GPIO_MODE_OUTPUT | GPIO_VALUE_ONE | GPIO_PORT6 | GPIO_PIN28)

/* Button definitions *******************************************************/
/* to be provided */

/****************************************************************************
 * Public Types
 ****************************************************************************/

/****************************************************************************
 * Public data
 ****************************************************************************/

#ifndef __ASSEMBLY__

/****************************************************************************
 * Public Functions
 ****************************************************************************/

#endif /* __ASSEMBLY__ */
#endif /* _CONFIGS_LPC4357_DEV_SRC_LPC3257_DEV_H */
